{
  "name": "4th Street Food Coop",
  "description": "New member trainer & Tech Team member",
  "url": "https://4thstreetfoodcoop.org/",
  "timeline": "2008-2010 ish",
  "location": "58 E 4th St, New York, NY 10003",
  "background": "bg-dark-green",
  "photos": null,
  "history": "\"The Good Food Coop started a long time ago. 1973 maybe. It died in the 90s, possibly for financial reasons. The Good Harvest Food Coop (D.B.A. 4th Street Food Coop) was created sometime thereafter.\nIt's not completely clear how to me how the two are related. I've been told that GFC closed a couple of years before GHFC started, making it not so much a \"phoenix from the ashes\" as a \"tree grown from a seed that survived the fire\" :)\nGood Food Coop I started out with 2 contacts, given by Chris Brandt, an old school member. 1 of those 2 contacts gave 6 other names. Some are just maybes, it was a long time ago. I have addresses for 2 of them, and will send out letters this week inviting them to participate. Hopefully they will either have contact info for the others, prove to be helpful, or both.\nFrom my 5 minutes of Conversation with my one contact (Joel Handorff), it's looking really juicy and promising.  Apparently many of the founders of the GFC met via \"organizing\" - rent strikes, etc.. and that some of those members had known each other through political action in the 30s. If that's true, there's a lot of depth here.\nI still have to find the founders of the GHFC though.\nWhen I've contacted all of the actual GFC & GHFC founders I can.. I'll be in touch.\nI've started page on the wiki. Sorry if you can't access it because you don't have an account.. IT is working on having a training & signup day, so that we can better collaborate.. hopefully that will happen sooner than later. http://4thstreetfoodcoop.org/bin/wiki/foodcoop/view/Members/AdminCoopHistory\"\n",
  "meta": {
    "index": 11,
    "fileName": "4th-street-food-coop.md",
    "section": "/",
    "dirName": "/projects"
  },
  "date": "2018-01-16",
  "path": "/projects/projects/4th-street-food-coop",
  "permalink": "/projects/4th-street-food-coop",
  "anchors": [],
  "body": "<p>4th Steet Food Coop is a member run coop located on quaint 4th street in the East Village. I was a working member for a few years. I trained new members weekly. I also served on Tech Team which is where I learned about <a href=\"https://mayfirst.org\">Mayfirst/People Link</a>, first started working with Drupal, and meet the brilliant radical techie, <a href=\"https://twitter.com/chaoticfree\">Mallory Knodell</a>. She also taught me the term <em>radical techie</em>.</p>\n"
}